# 1. (5б)Что такое git? (Своими словами)
# 2. (5б)Как вы понимаете роль командной строки/терминала?(своими словами)
# 3. (5б)Какой командой можно отобразить список папок и файлов в терминале?
# ls
# 4. (5б)Какой командой можно создать папку в терминале?
# mkdir
# 5. (5б)Какой командой можно создать файл в терминале?
# touch
# 6. (5б)Какой командой можно перейти в домашнюю директорию в терминале?
# cd ~
# 7. (5б)Какой командой можно проверить «изменения» (статус файлов) в файлах через git?
# git status
# 8. (5б)Какой командой можно добавить файл test.py к коммиту?
# git add test.py
# 9. (5б)Какой командой можно создать коммит с кратким комментарием?
# git commit -m "comment"
# 10. (5б)Какой командой можно загрузить все Файлы в гит репозиторий?
# git push -u origin master
# 11. (5б)Какая функция (python) отображает информацию в консоль/терминал?
# print()
# 12. (5б)Какая функция (python) запрашивает информацию от пользователя из консоли/терминала?
# input()
# 13. (10б)Чему равно данное значение 101001 в десятичной системе?
from decimal import Decimal
a = Decimal(0b101001)
print(a)
# 14. (10б)Чему равно данное значение 1eab5f в десятичной системе?
b = Decimal(0x1eab5f)
print(b)
# 15. (20б)Напишите программу которая запрашивала бы от пользователя любое значение и отображала в двоичной системе и выводила бы квадрат данного значения.



n = int(input('ведите число: '))

print('binary = ', bin(n))
print('power  = ', pow(n,2))

